Revit 2026 API

# TemperatureRatingTypeSetSize Property

---

Returns the number of TemperatureRating types that are in the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Size { get; }
```
```vb
Public Overridable ReadOnly Property Size As Integer
	Get
```
```cpp
public:
virtual property int Size {
	int get ();
}
```
```fsharp
abstract Size : int with get
override Size : int with get
```

#### Property Value

Int32

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace